test/request-response-samples/GetAccountXml__non_xmlns_attributes_should_be_returned/request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="#Foo" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/"><SOAP-ENV:Body><tns:GetAccountXml xmlns:tns="#Foo" xmlns="#Foo"><tns:ResourceID>234</tns:ResourceID><tns:ResourceType>foo</tns:ResourceType><tns:IDType>more foo</tns:IDType><tns:TreeID>43</tns:TreeID><tns:PrivateLabelID>34</tns:PrivateLabelID></tns:GetAccountXml></SOAP-ENV:Body></SOAP-ENV:Envelope>